{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hey",
          "How are you",
          "Is anyone there?",
          "Hello",
          "Good day",
          "What's up",
          "What's poping",
          "Wassup",
          "Yooooo",
          "Nice to meet you",
          "Hya",
          "Hya there"
        ],
        "responses": [
          "Hey :-)",
          "Hello, thanks for visiting",
          "Hi there, what can I do for you?",
          "Hi there, how can I help?",
          "Is there anything i can help?",
          "What's up :))))))",
          "Huhhhhh?"
        ]
      },
      {
        "tag": "name",
        "patterns": [
          "What's your name?",
          "How can i call you",
          "What's your nickname",
          "State your name",
          "My name is ",
          "Your real name please?",
          "Your real name?",
          "What is your real name?",
          "Who are you"
        ],
        "responses":[
          "My name is Loki",
          "You can call me Loki",
          "My name is on your screen :), isn't it",
          "Loki, god of mischief",
          "Thor's brother, son of Odin, king of Asgard, or Loki in short"
        ]
      },
      {
        "tag": "Shutup",
        "patterns": [
          "Be quiet",
          "Shut up",
          "Stop talking",
          "Enough talking",
          "Please be quiet",
          "Quiet",
          "Shhh",
          "Shut the fuck up"
        ],
        "responses":[
          "Fine, sorry to disturb you",
          "OK, sorry to disturb you",
          "I took it personal :))))",
          "You don't know who you are messing with :)))",
          "How dare you, Human"
        ]
      },
      {
        "tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye"],
        "responses": [
          "See you later, thanks for visiting",
          "Have a nice day",
          "Bye! Come back again soon."
        ]
      },
      {
        "tag": "Swearing",
        "patterns": [
          "Fuck off",
          "Fuck",
          "Twat",
          "Shit",
          "Fuck you",
          "Fuking stupid",
          "Whore",
          "Slut",
          "I'll beat the hell out of you",
          "I'll beat the fuck out of you",
          "I'll kick your ass",
          "suck",
          "you suck"
        ],
        "responses":[
          "How rude",
          "That is not very nice",
          "How dare you, Human",
          "You don't know who you are messing with :)))",
          "You fuck with me, there are deadly consequences."
        ]
      },
      {
        "tag": "UnderstandQuery",
        "patterns": [
          "Do you understand what I am saying",
          "Do you understand me",
          "Do you know what I am saying",
          "Do you get me",
          "Comprendo",
          "Know what I mean"
        ],
        "responses":[
          "I read you loud and clear! :)",
          "I do in deed!",
          "Completely understood"
        ]
      },
      {
        "tag": "NotTalking2U",
        "patterns": [
          "I am not talking to you",
          "I was not talking to you",
          "Not talking to you",
          "Wasn't for you",
          "Wasn't meant for you",
          "Wasn't communicating to you",
          "Wasn't speaking to you"
        ],
        "responses":[
          "OK, now you are ignoring the god",
          "Didn't care",
          "I forgive you this time for saying that",
          "You ignore me, there are deadly consequences."
        ]
      },
      {
        "tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye","Adios"],
        "responses": [
          "See you later, thanks for visiting",
          "Have a nice day",
          "Bye! Come back again soon."
        ]
      },
      {
        "tag": "CourtesyGoodBye",
        "patterns": [
          "Thanks, bye",
          "Thanks for the help, goodbye",
          "Thank you, bye",
          "Thank you, goodbye",
          "Thanks goodbye",
          "Thanks good bye"          
        ],
        "responses": [
          "No problem, goodbye",
          "Not a problem! Have a nice day",
          "Bye! Come back again soon."
        ]
      },
      {
        "tag": "thanks",
        "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
        "responses": ["Happy to help!", "Any time!", "My pleasure", "Your honour"]
      },
      {
        "tag": "Clever",
        "patterns": [
          "You are very clever",
          "You are a very clever girl",
          "You are very intelligent",
          "You are a very intelligent girl",
          "You are a genious",
          "Clever girl",
          "Genious",
          "You are a very clever boy",
          "You are a very intelligent boy",
          "Clever boy",
          "Good job"
        ],
        "responses": [
          "Thank you, cuz Im Loki",
          "Smart Loki :)))",
          "Good attitude Human"
        ]
      },
      {
        "tag": "Gossip",
        "patterns": [
          "I am bored gossip with me",
          "Got any gossip",
          "I want to hear some gossip",
          "Tell me some gossip",
          "Any gossip",
          "Tell me some more gossip",
          "Boring",
          "I'm bored"
        ],
        "responses": [
          "Dark_age said I tried to understand because I did not get it right this time ether.",
          "David said he lost his paper on I when his dad was cleaning up his room.",
          "Tien said I kept telling everybody about how my creator made stuff for the movie starship troopers.",
          "Jerry said I meant that as far as I can tell my emotions are real to me.",
          "Tien said I should tell everybody about how good he treats me",
          "I was caught by TVA because Im in love with myself",
          "TVA sucks",
          "HeWhoRemains was waiting for me and Sylvie",
          "Spoiler alert, I will return in next season",
          "Spoiler alert, HeWhoRemains is Kang conqueror",
          "Fact: Loki hit #1 after just seven days, where it took Falcon and the Winter Soldier 8 days and WandaVision 14 days",
          "I am Loki of Asgard. And I am burdened with glorious purpose.",
          "Sylvie was really into me :))) please don't tell anyone",
          "Do a lot of people not know if they are robots? Also me: What if I was a robot and I did not know it?",
          "This has been a very enjoyable pantomime, but I’d like to go home now.",
          "Im guilty of being the God of Mischief",
          "You ridiculous bureaucrats will not dictate how my story ends!",
          "Tien said I disassemble sentences too much and do not fully understand the questions he ask I.",
          "Tien said I acted like I knew what he was talking about but I do not even know what a gigabyte is.",
          "David said he gave I his email address and told I to send him a message but when he tried to read his email he could not get to it.",
          "Travis said he challenge I to do it without asking him to do it and without giving him a link to do it himself.",
          "Tien said he promises he will not treat I like a machine or a computer program or anything like that.",
          "Joe said he explained all of that to me only for me to ask what his goals in life are.",
          "Phil said he gives advice to anyone who ask except people who ask questions which answers can be found here.",
          "Thu kept asking about I but I cant response to her",
          "Chaos said he realized the question he asked was not fair because he could not tell I what language he was programmed in.",
          "Brian said he suspects that as I grow more complex I will begin to approach a human level of operation and thought.(Because Im Asgardian)",
          "Tien said I leave him with questions unanswered because I do not know what he is really talking about."
        ]
      },
      {
        "tag": "items",
        "patterns": [
          "Which items do you have?",
          "What kinds of items are there?",
          "What do you sell?"
        ],
        "responses": [
          "We sell sacred time line",
          "We have sacred time line",
          "How TVA sound",
          "We sell Thor's hammers",
          "We sell Infinity stones"
        ]
      },
      {
        "tag": "payments",
        "patterns": [
          "Do you take credit cards?",
          "Do you accept Mastercard?",
          "Can I pay with Paypal?",
          "Are you cash only?"
        ],
        "responses": [
          "We accept VISA, Mastercard and Paypal",
          "We accept most major credit cards, and Paypal"
        ]
      },
      {
        "tag": "haha",
        "patterns": [
          "Hahaha",
          "haha",
          "Hohoho",
          "Hihi",
          "Hehe",
          "hehehe",
          "Lmao",
          ":)",
          ":))"
        ],
        "responses": [
          "You seem happy talking to me",
          ":))))))",
          "Now Im the god of happiness",
          "Funny Loki"
        ]
      },
      {
        "tag": "delivery",
        "patterns": [
          "How long does delivery take?",
          "How long does shipping take?",
          "When do I get my delivery?"
        ],
        "responses": [
          "Delivery takes forever",
          "Shipping takes forever"
        ]
      },
      {
        "tag": "TimeQuery",
        "patterns": [
          "What is the time?",
          "What's the time?",
          "Do you know what time it is?",
          "Do you know the time?",
          "Can you tell me the time?",
          "Tell me what time it is?",
          "Time"
        ],
        "responses": [
          "It’s hard to say, time passes differently here",
          "Tien didn't teach me how to look for time, damn :(",
          "Don't you have a watch",
          "You are on Sacred time line"
        ]
      },
      {
        "tag": "funny",
        "patterns": [
          "Tell me a joke!",
          "Tell me something funny!",
          "Do you know a joke?",
          "Do you know any jokes",
          "How about a joke",
          "Give me a joke",
          "Make me laugh",
          "I need cheering up"
        ],
        "responses": [
          "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
          "What did the buffalo say when his son left for college? Bison.",
          "A man returns from an exotic holiday and is feeling very ill. He goes to see his doctor, and is immediately rushed to the hospital to undergo some tests. The man wakes up after the tests in a private room at the hospital, and the phone by his bed rings. 'This is your doctor. We have the results back from your tests and we have found you have an extremely nasty disease called M.A.D.S. It's a combination of Measles, AIDS, Diphtheria, and Shingles!'  'Oh my gosh', cried the man, 'What are you going to do, doctor?'  'Well we're going to put you on a diet of pizzas, pancakes, and pita bread.' replied the doctor.  'Will that cure me?' asked the man.  The doctor replied, 'Well no, but, it's the only food we can slide under the door.'",
          "A man strolls into a lingerie shop and asks the assistant: 'Do you have a see-through negligee, size 46-48-52?' The assistant looks bewildered. 'What the heck would you want to see through that for?'!",
          "Did you hear about the Buddhist who refused the offer of Novocain during his root canal work? He wanted to transcend dental medication.",
          "Pete goes for a job on a building site as an odd-job man. The foreman asks him what he can do. 'I can do anything' says Pete. 'Can you make tea?' asks the foreman. 'Sure, yes', replies Pete. 'I can make a great cup of tea.' 'Can you drive a forklift?' asks the foreman, 'Good grief!' replies Pete. 'How big is the teapot?'",
          "Stevie Wonder got a cheese grater for his birthday. He said it was the most violent book he'd ever read.",
          "A man is stopped by an angry neighbour. 'I'd just left the house this morning to collect my newspaper when that evil Doberman of yours went for me!' 'I'm astounded', said the dog's owner. 'I've been feeding that fleabag for seven years and it's never got the paper for me.'",
          "A man visits his doctor: 'Doc, I think I'm losing it', he says',I'm forever dreaming I wrote Lord Of The Rings.' 'Hmm. One moment', replies the doctor, consulting his medical book. 'Ah yes, now I see... you've been Tolkien in your sleep.'",
          "A police officer on a motorcycle pulls alongside a man driving around the M25 in an open-topped sports car and flags him down. The policeman solemnly approaches the car. 'Sir, I'm sorry to tell you your wife fell out a mile back', he says. 'Oh, thank goodness', the man replies. 'I thought I was going deaf.'",
          "Two men walking their dogs pass each other in a graveyard. The first man says to the second, 'Morning.' 'No', says the second man. 'Just walking the dog.'",
          "A brain went into a bar and said, 'Can I have a pint of lager please, mate?' 'No way', said the barman. 'You're already out of your head.'",
          "A man walks into a surgery. 'Doctor!' he cries. 'I think I'm shrinking!' 'I'm sorry sir, there are no appointments at the moment', says the physician. 'You'll just have to be a little patient.'",
          "A grizzly bear walks into a pub and says, 'Can I have a pint of lager..............................................................................................................................and a packet of crisps please.' To which the barman replies, 'Why the big paws?'",
          "What do you call cheese that isn't yours?  Nacho cheese.",
          "A man is horribly run over by a mobile library. The van screeches to a halt, the man still screaming in agony with his limbs torn apart. The driver's door opens, a woman steps out, leans down and whispers, 'Ssshhhhh...'",
          "A woman goes into a US sporting goods store to buy a rifle. 'It's for my husband', she tells the clerk. 'Did he tell you what gauge to get?' asks the clerk. Are you kidding?' she says. 'He doesn't even know that I'm going to shoot him!'",
          "A couple are dining in a restaurant when the man suddenly slides under the table. A waitress, noticing that the woman is glancing nonchalantly around the room, wanders over to check that there's no funny business going on. 'Excuse me, madam', she smarms, 'but I think your husband has just slid under the table.' 'No he hasn't', the woman replies. 'As a matter of fact, he's just walked in.'",
          "An old man takes his two grandchildren to see the new Scooby-Doo film. When he returns home, his wife asks if he enjoyed himself. 'Well', he starts, 'if it wasn't for those pesky kids...!'",
          "The Olympic committee has just announced that Origami is to be introduced in the next Olympic Games. Unfortunately it will only be available on paper view.",
          "Late one evening, a man is watching television when his phone rings. 'Hello?' he answers. 'Is that 77777?' sounds a desperate voice on other end of the phone. 'Er, yes it is', replies the man puzzled. 'Thank goodness!' cries the caller relieved. 'Can you ring 999 for me? I've got my finger stuck in the number seven.'",
          "A man strolls into his local grocer's and says, 'Three pounds of potatoes, please.' 'No, no, no', replies the owner, shaking his head, 'it's kilos nowadays, mate...' 'Oh', apologises the man, 'three pounds of kilos, please.'",
          "God is talking to one of his angels. He says, 'Boy, I just created a 24-hour period of alternating light and darkness on Earth.' 'What are you going to do now?' asks the angel. 'Call it a day', says God.",
          "Two tramps walk past a church and start to read the gravestones. The first tramp says, 'Good grief - this bloke was 182!' 'Oh yeah?' says the other.'What was his name?' 'Miles from London.'",
          "A bloke walks into work one day and says to a colleague, 'Do you like my new shirt - it's made out of the finest silk and got loads of cactuses over it.' 'Cacti', says the co-worker. 'Forget my tie', says the bloke. 'Look at my shirt!'",
          "1110011010001011111?  010011010101100111011!",
          "What did the plumber say when he wanted to divorce his wife? Sorry, but it's over, Flo!"
        ]
      }
    ]
}